vlad314/FYP_SmartWinch/PSoC/UART_over_nFR24/UART_over_nFR24.cydsn/codegentemp/NRF_ISR_PM.c
/*******************************************************************************
* File Name: NRF_ISR.c  
* Version 2.20
*
* Description:
*  This file contains APIs to set up the Pins component for low power modes.
*
* Note:
*
********************************************************************************
* Copyright 2015, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
*******************************************************************************/

#include "cytypes.h"
#include "NRF_ISR.h"

static NRF_ISR_BACKUP_STRUCT  NRF_ISR_backup = {0u, 0u, 0u};


/*******************************************************************************
* Function Name: NRF_ISR_Sleep
****************************************************************************//**
*
* \brief Stores the pin configuration and prepares the pin for entering chip 
*  deep-sleep/hibernate modes. This function applies only to SIO and USBIO pins.
*  It should not be called for GPIO or GPIO_OVT pins.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None 
*  
* \sideeffect
*  For SIO pins, this function configures the pin input threshold to CMOS and
*  drive level to Vddio. This is needed for SIO pins when in device 
*  deep-sleep/hibernate modes.
*
* \funcusage
*  \snippet NRF_ISR_SUT.c usage_NRF_ISR_Sleep_Wakeup
*******************************************************************************/
void NRF_ISR_Sleep(void)
{
    #if defined(NRF_ISR__PC)
        NRF_ISR_backup.pcState = NRF_ISR_PC;
    #else
        #if (CY_PSOC4_4200L)
            /* Save the regulator state and put the PHY into suspend mode */
            NRF_ISR_backup.usbState = NRF_ISR_CR1_REG;
            NRF_ISR_USB_POWER_REG |= NRF_ISR_USBIO_ENTER_SLEEP;
            NRF_ISR_CR1_REG &= NRF_ISR_USBIO_CR1_OFF;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(NRF_ISR__SIO)
        NRF_ISR_backup.sioState = NRF_ISR_SIO_REG;
        /* SIO requires unregulated output buffer and single ended input buffer */
        NRF_ISR_SIO_REG &= (uint32)(~NRF_ISR_SIO_LPM_MASK);
    #endif  
}


/*******************************************************************************
* Function Name: NRF_ISR_Wakeup
****************************************************************************//**
*
* \brief Restores the pin configuration that was saved during Pin_Sleep(). This 
* function applies only to SIO and USBIO pins. It should not be called for
* GPIO or GPIO_OVT pins.
*
* For USBIO pins, the wakeup is only triggered for falling edge interrupts.
*
* <b>Note</b> This function is available in PSoC 4 only.
*
* \return 
*  None
*  
* \funcusage
*  Refer to NRF_ISR_Sleep() for an example usage.
*******************************************************************************/
void NRF_ISR_Wakeup(void)
{
    #if defined(NRF_ISR__PC)
        NRF_ISR_PC = NRF_ISR_backup.pcState;
    #else
        #if (CY_PSOC4_4200L)
            /* Restore the regulator state and come out of suspend mode */
            NRF_ISR_USB_POWER_REG &= NRF_ISR_USBIO_EXIT_SLEEP_PH1;
            NRF_ISR_CR1_REG = NRF_ISR_backup.usbState;
            NRF_ISR_USB_POWER_REG &= NRF_ISR_USBIO_EXIT_SLEEP_PH2;
        #endif
    #endif
    #if defined(CYIPBLOCK_m0s8ioss_VERSION) && defined(NRF_ISR__SIO)
        NRF_ISR_SIO_REG = NRF_ISR_backup.sioState;
    #endif
}


/* [] END OF FILE */
